app/Http/Controllers/EventController.php

    public function index(Request $request) {
        return view('events.index', ['events' => Event::all()]);
---
SELECT * FROM `events`

    public function show(Request $request, $id) {
        $event = Event::find($id);
        $event_name = $event->name;
        $activityRound = ActivityRound::where('eventround_id', $id)->get();
        //dd($event->enlitments);
        $activity_enlistments = Activity::where('event_id', $id)->get();
---
SELECT * FROM `events` WHERE `events`.`id` = '3' LIMIT 1
SELECT * FROM `activity_rounds` WHERE `eventround_id` = '3'
SELECT * FROM `activities` WHERE `activities`.`event_id` = 3 and `activities`.`event_id` IS not NULL