app/Models/Activity.php

    function availability($eventround_id) {
        $enlistment_count = $this->enlistments()->where('round_id', $eventround_id)->count();
---
SELECT count(*) as aggregate FROM `enlistments` WHERE `enlistments`.`activity_id` = 3 and `enlistments`.`activity_id` IS not NULL and `round_id` = 1