app/Models/Event.php

SELECT count(*) as aggregate FROM `eventrounds` WHERE `eventrounds`.`event_id` = 3 and `eventrounds`.`event_id` IS not NULL
---
    public function has_rounds()
    {
        return $this->hasMany(Eventround::class, 'event_id', 'id')->count() > 0;